/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: 北京智芯微电子                                                   */
/*                                                                            */
/* 文件名称: SCM62X_NFC.c                                                     */
/* 内容摘要: NFC模块基础函数定义                                              */
/* 其它说明: **                                                               */
/* 当前版本: V1.0                                                             */
/* 作    者: SCM                                                              */
/* 完成日期: 2019-03-20                                                       */
/* 修改记录:                                                                  */
/*    修改日期          版本号        修改人        修改内容                  */
/* -------------------------------------------------------------------------- */
/*    2019-03-20        V1.0          SCM        创建文件                     */
/*<FH->************************************************************************/


/******************************************************************************/
/*               #include（依次为标准库头文件、非标准库头文件）               */
/******************************************************************************/
#include "SCM62X.h"

/******************************************************************************/
/*                                外部引用定义                                */
/******************************************************************************/


/******************************************************************************/
/*                                  全局变量                                  */
/******************************************************************************/


/******************************************************************************/
/*                                 函数的实现                                 */
/******************************************************************************/
/*<FUNC+>**********************************************************************/
/* 函数名称: fc_send_cmd                                                      */
/* 功能描述: use Controller send cmd to cmdfifo, this is the function to grou */
/*           p the 32bit command, and send to ch0_cmdfifo                     */
/* 输入参数: ce --- select chip : 0:chip 0; 1:chip 1; 2:chip 2; 3:chip 3      */
/*           cmd_type --- 1:co mmand; 2:address; 3:fdma; 4:status;5:wait R/#B;*/
/*                        6:delay; 7:run                                      */
/*           opt --- when address: 1: low 1byte;  2: low 2byte;  3 or 0: 3byte */
/*                   when fdma: option[1]=0: data write; option[1]=1: data read;*/
/*                              option[0]=0: mode 0; option[0]=1: mode 1        */
/*           CodeIn ---the command's byte2 byte1 byte0                        */
/*                                          */
/* 输出参数: 无                                                               */
/* 返 回 值: 无                                                               */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*    2018-06-29        V1.0          SCM        创建函数                     */
/*<FUNC->**********************************************************************/
void fc_send_cmd(unsigned char ce, // 0:chip 0; 1:chip 1; 2:chip 2; 3:chip 3;
                 unsigned char cmd_type, //1:command; 2:address; 3:fdma; 4:status; 
                                         //5:wait R/#B; 6:delay; 7:run
                 unsigned char opt, //when address: 1: low 1byte; 
                                    //              2: low 2byte; 
                                    //              3 or 0: 3byte 
                                    //when fdma:   option[1]=0: data write; 
                                    //             option[1]=1: data read; 
                                    //             option[0]=0: mode 0; 
                                    //             option[0]=1: mode 1
                 unsigned int CodeIn)
{
  SGCC_NFC_REG_P->ch0_cmdfifo = (((ce & 0x7) << 29)        | 
                                 ((opt & 0x3) << 27)       |
                                 ((cmd_type & 0x7) << 24)  | 
                                 (CodeIn & 0xffffff)       );
  
}

/*<FUNC+>**********************************************************************/
/* 函数名称: wait_cmd_success                                                 */
/* 功能描述: wait cmd success :                                               */
/* 输入参数: 无                                                               */
/* 输出参数: 无                                                               */
/* 返 回 值: 无                                                               */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*    2018-06-29        V1.0          SCM        创建函数                     */
/*<FUNC->**********************************************************************/
void wait_cmd_success(void) {
 //wait int fifo not empty
  while((SGCC_NFC_REG_P->int_status&1)==0) {
    __asm__("nop");
  }

  //wait SUCCESS INT
  while( (SGCC_NFC_REG_P->sys_int_fifo&(1<<7))==0) {
    __asm__("nop");
  }
}

/******************************************************************************/
/* Nand Flash，K9F1208U0B基础函数定义                                         */
/******************************************************************************/
